In [2]:
#Import Pandas
import pandas as pd

In [4]:
data = {
    "Name":["Supriya", "Rohit", "Raghav"],
    "age":["33","33","3"],
    "city":["Pune","pune","pune"]
    }

In [5]:
#Create Data Frame
dataF = pd.DataFrame(data)
print(dataF)

      Name age  city
0  Supriya  33  Pune
1    Rohit  33  pune
2   Raghav   3  pune

In [34]:
#Read Data from CSV file
cr = pd.read_csv('E:/GitProject/data.csv')

In [7]:
#Print Data
print(cr.head)

<bound method NDFrame.head of    EmployeeID     Name Department   Salary  Experience    City
0         101     Amit         IT  60000.0           3    Pune
1         102     Riya         HR  45000.0           5  Mumbai
2         103  Supriya         IT  70000.0           7    Pune
3         104   Raghav    Finance  65000.0           4   Delhi
4         105  Shiveta         HR      NaN           6  Mumbai
5         106     Neha         IT  72000.0           2    Pune
6         107    Karan    Finance  68000.0           5   Delhi
7         108    Pooja         HR  50000.0           3  Mumbai>

In [8]:
#Print Selected Column
print(cr['EmployeeID'])

0    101
1    102
2    103
3    104
4    105
5    106
6    107
7    108
Name: EmployeeID, dtype: int64

In [9]:
#Print Selected Columns
print(cr[['EmployeeID','City']])

   EmployeeID    City
0         101    Pune
1         102  Mumbai
2         103    Pune
3         104   Delhi
4         105  Mumbai
5         106    Pune
6         107   Delhi
7         108  Mumbai

In [10]:
#Filtering Data
print(cr[cr["Experience"] > 3])

   EmployeeID     Name Department   Salary  Experience    City
1         102     Riya         HR  45000.0           5  Mumbai
2         103  Supriya         IT  70000.0           7    Pune
3         104   Raghav    Finance  65000.0           4   Delhi
4         105  Shiveta         HR      NaN           6  Mumbai
6         107    Karan    Finance  68000.0           5   Delhi

In [12]:
#Add New Column in CSV
cr["Age"] = [26, 28, 40,22,34,32,33,31]
print(cr)

   EmployeeID     Name Department   Salary  Experience    City  Age
0         101     Amit         IT  60000.0           3    Pune   26
1         102     Riya         HR  45000.0           5  Mumbai   28
2         103  Supriya         IT  70000.0           7    Pune   40
3         104   Raghav    Finance  65000.0           4   Delhi   22
4         105  Shiveta         HR      NaN           6  Mumbai   34
5         106     Neha         IT  72000.0           2    Pune   32
6         107    Karan    Finance  68000.0           5   Delhi   33
7         108    Pooja         HR  50000.0           3  Mumbai   31

In [13]:
#If False = Not Null
#if True =Null
cr.isnull()

   EmployeeID   Name  Department  Salary  Experience   City    Age
0       False  False       False   False       False  False  False
1       False  False       False   False       False  False  False
2       False  False       False   False       False  False  False
3       False  False       False   False       False  False  False
4       False  False       False    True       False  False  False
5       False  False       False   False       False  False  False
6       False  False       False   False       False  False  False
7       False  False       False   False       False  False  False

In [14]:
#Set Null value =0
cr.fillna(0)

   EmployeeID     Name Department   Salary  Experience    City  Age
0         101     Amit         IT  60000.0           3    Pune   26
1         102     Riya         HR  45000.0           5  Mumbai   28
2         103  Supriya         IT  70000.0           7    Pune   40
3         104   Raghav    Finance  65000.0           4   Delhi   22
4         105  Shiveta         HR      0.0           6  Mumbai   34
5         106     Neha         IT  72000.0           2    Pune   32
6         107    Karan    Finance  68000.0           5   Delhi   33
7         108    Pooja         HR  50000.0           3  Mumbai   31

In [15]:
#Drop row if null value is present
cr.dropna()

   EmployeeID     Name Department   Salary  Experience    City  Age
0         101     Amit         IT  60000.0           3    Pune   26
1         102     Riya         HR  45000.0           5  Mumbai   28
2         103  Supriya         IT  70000.0           7    Pune   40
3         104   Raghav    Finance  65000.0           4   Delhi   22
5         106     Neha         IT  72000.0           2    Pune   32
6         107    Karan    Finance  68000.0           5   Delhi   33
7         108    Pooja         HR  50000.0           3  Mumbai   31

In [33]:
#Sort by column
cr.sort_values(by="Age", ascending=False)

   EmployeeID     Name Department        Salary  Experience    City  Age
2         103  Supriya         IT  70000.000000           7    Pune   40
4         105  Shiveta         HR  61428.571429           6  Mumbai   34
6         107    Karan    Finance  68000.000000           5   Delhi   33
5         106     Neha         IT  72000.000000           2    Pune   32
7         108    Pooja         HR  50000.000000           3  Mumbai   31
1         102     Riya         HR  45000.000000           5  Mumbai   28
0         101     Amit         IT  60000.000000           3    Pune   26
3         104   Raghav    Finance  65000.000000           4   Delhi   22

NameError: name 'df' is not defined

In [32]:
#Basic Statistics
print(cr.describe())

       EmployeeID        Salary  Experience        Age
count     8.00000      8.000000    8.000000   8.000000
mean    104.50000  61428.571429    4.375000  30.750000
std       2.44949   9589.535112    1.685018   5.470701
min     101.00000  45000.000000    2.000000  22.000000
25%     102.75000  57500.000000    3.000000  27.500000
50%     104.50000  63214.285714    4.500000  31.500000
75%     106.25000  68500.000000    5.250000  33.250000
max     108.00000  72000.000000    7.000000  40.000000

In [20]:
#Save Data to CSV
cr.to_csv("E:/GitProject/output.csv", index=False)

In [21]:
#check how many missing (NULL / NaN) values
cr.isnull().sum()

EmployeeID    0
Name          0
Department    0
Salary        1
Experience    0
City          0
Age           0
dtype: int64

In [29]:
#average (mean) salary
cr["Salary"].mean();

In [30]:
cr["Salary"] = cr["Salary"].fillna(cr["Salary"].mean())

In [35]:
cr

   EmployeeID     Name Department   Salary  Experience    City
0         101     Amit         IT  60000.0           3    Pune
1         102     Riya         HR  45000.0           5  Mumbai
2         103  Supriya         IT  70000.0           7    Pune
3         104   Raghav    Finance  65000.0           4   Delhi
4         105  Shiveta         HR      NaN           6  Mumbai
5         106     Neha         IT  72000.0           2    Pune
6         107    Karan    Finance  68000.0           5   Delhi
7         108    Pooja         HR  50000.0           3  Mumbai

In [60]:
cr[(cr["Department"] == "HR") & (cr["Salary"] > 40000)]

   EmployeeID     Name Department        Salary  Experience    City  Age
1         102     Riya         HR  45000.000000           5  Mumbai   28
4         105  Shiveta         HR  61428.571429           6  Mumbai   34
7         108    Pooja         HR  50000.000000           3  Mumbai   31

In [63]:
cr.loc[cr["Salary"].idxmax()]

EmployeeID        106
Name             Neha
Department         IT
Salary        72000.0
Experience          2
City             Pune
Age                32
Name: 5, dtype: object

In [64]:
cr.rename(columns={"Salary":"MonthlySalary"},inplace=True)

In [65]:
cr

   EmployeeID     Name Department  MonthlySalary  Experience    City  Age
0         101     Amit         IT   60000.000000           3    Pune   26
1         102     Riya         HR   45000.000000           5  Mumbai   28
2         103  Supriya         IT   70000.000000           7    Pune   40
3         104   Raghav    Finance   65000.000000           4   Delhi   22
4         105  Shiveta         HR   61428.571429           6  Mumbai   34
5         106     Neha         IT   72000.000000           2    Pune   32
6         107    Karan    Finance   68000.000000           5   Delhi   33
7         108    Pooja         HR   50000.000000           3  Mumbai   31

In [66]:
cr["Department"].value_counts()

Department
IT         3
HR         3
Finance    2
Name: count, dtype: int64

In [67]:
cr["MonthlySalary"]=cr["MonthlySalary"].astype(int)

In [68]:
cr

   EmployeeID     Name Department  MonthlySalary  Experience    City  Age
0         101     Amit         IT          60000           3    Pune   26
1         102     Riya         HR          45000           5  Mumbai   28
2         103  Supriya         IT          70000           7    Pune   40
3         104   Raghav    Finance          65000           4   Delhi   22
4         105  Shiveta         HR          61428           6  Mumbai   34
5         106     Neha         IT          72000           2    Pune   32
6         107    Karan    Finance          68000           5   Delhi   33
7         108    Pooja         HR          50000           3  Mumbai   31

In [70]:
pd.pivot_table(cr, values="MonthlySalary",
               index="Department",
               aggfunc="mean")

            MonthlySalary
Department
Finance      66500.000000
HR           52142.666667
IT           67333.333333